## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:59" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:59" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:8cc5dc1f55c8938af6900352e14317d66a0b7b01be84e407759b783c590f8f9d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:0abec7a46a97ce8c6a53054e1a03973a64387c34a7d17838c09d7c456a421139"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 59 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "c3faa07aa23dbaf9d25281622152bc55-5" -> "1e4683cb85e97d3200d97928196ea632"
        id                     = "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip"
        tags                   = {}
      ~ version_id             = "ZUseV7SFLq5vOzcBH3OVEgaYHn4mVyc1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "46bd4905044bdd17d1d04ca5c42f955f-6" -> "db2decf258f703af202a664d565cbcd6"
        id                     = "excelToJson.db2decf258f703af202a664d565cbcd6.zip"
        tags                   = {}
      ~ version_id             = "eASLrwjHyov.k.yXqY5EJEW_SZmEicGw" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0f79c21f9eb94539042c7ac6b4f46415-6" -> "9c5a89250569f33bfd05c74c27223f4a"
      ~ id                     = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> (known after apply)
      ~ key                    = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> "graphql.9c5a89250569f33bfd05c74c27223f4a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "ab8ab0d973c39faaa38946663c86d25d" -> "9c5a89250569f33bfd05c74c27223f4a"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Z7rDqXyRoQm7bKD4Axm4RoFUj875pRLc" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a9a2325926a7d309241059e13ef44af5" -> "390a8f58274f171a5896ed6aa1289564"
        id                     = "dist/200.html"
      ~ source_hash            = "a9a2325926a7d309241059e13ef44af5" -> "390a8f58274f171a5896ed6aa1289564"
        tags                   = {}
      ~ version_id             = "pp1s3b1__dOo537oSYsLbqn_JiJab.Wc" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "21c7a5713eec98d43125caf0c31db977" -> "530e0b0914500705b8ad5d29c0b4a72d"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "21c7a5713eec98d43125caf0c31db977" -> "530e0b0914500705b8ad5d29c0b4a72d"
        tags                   = {}
      ~ version_id             = "j_uEw8Npwcb68Nm5kgMOC9_0OupDBdTd" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2385c20fda17aff138e5df5b803f9b91" -> "455a3279fe3a198dfdc17ed423f2ad2f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "2385c20fda17aff138e5df5b803f9b91" -> "455a3279fe3a198dfdc17ed423f2ad2f"
        tags                   = {}
      ~ version_id             = "X_RQj3KmTbXry0EK5aOd6RE.1mce2CcS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a9a2325926a7d309241059e13ef44af5" -> "390a8f58274f171a5896ed6aa1289564"
        id                     = "dist/index.html"
      ~ source_hash            = "a9a2325926a7d309241059e13ef44af5" -> "390a8f58274f171a5896ed6aa1289564"
        tags                   = {}
      ~ version_id             = "PedlrxymkGd0chrCis3OhHaMb2XpyO3t" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js"
+       source_hash            = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.44fe760f.js"] will be destroyed
  # (because key ["static/js/app.44fe760f.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c2e98495564e83b5f027f0175063d510" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.44fe760f.js" -> null
-       key                    = "dist/static/js/app.44fe760f.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.44fe760f.js" -> null
-       source_hash            = "c2e98495564e83b5f027f0175063d510" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "u4WUFf7rQQKdyBgKWkmIuZT23hnm_DDx" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.44fe760f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.44fe760f.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "8muQX1nt5b4azupR6plcB3eC1lyvYWJo" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:28" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:28/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "28" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
              ~ "DD_TAGS"                      = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d107d319be2264c8316736beb32df2b2b09e8ac9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "28" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:28" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:28/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "28" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
              ~ "DD_TAGS"                      = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d107d319be2264c8316736beb32df2b2b09e8ac9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "28" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-03-22T22:47:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:75" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:75/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> "graphql.9c5a89250569f33bfd05c74c27223f4a.zip"
        tags                           = {}
      ~ version                        = "75" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
              ~ "DD_TAGS"                            = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d107d319be2264c8316736beb32df2b2b09e8ac9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "d107d319be2264c8316736beb32df2b2b09e8ac9"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "75" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8398115413)*